workstation/tutorials/lagrangian/kinematicParcelFoam/drippingChair/system/faMeshDefinition
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      faMeshDefinition;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

polyMeshPatches   (filmWalls);

boundary
{
    top
    {
        type                patch;
        ownerPolyPatch      filmWalls;
        neighbourPolyPatch  top;
    }

    bottom
    {
        type                patch;
        ownerPolyPatch      filmWalls;
        neighbourPolyPatch  bottom;
    }

    frontAndBack
    {
        type                patch;
        ownerPolyPatch      filmWalls;
        neighbourPolyPatch  frontAndBack;
    }
}


// ************************************************************************** //
